app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("post", "created_at", "updated_at") VALUES (?, ?, ?)  [["post", "1st post"], ["created_at", "2021-09-26 19:07:30.164079"], ["updated_at", "2021-09-26 19:07:30.164079"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "post" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["post", "1st user`s post"], ["updated_at", "2021-09-29 15:54:40.957614"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)